# Set Up

In [1]:
import os 

import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt

# Load the Hydrometric stations Data

In [2]:
data_dir = 'data/hydro/'
all_data_paths = os.listdir(data_dir)

In [3]:
def add_nans(x): 
    if x == 'nan' : 
        return np.nan 
    else : 
        return x

In [4]:
def corrcet_id(x) : 
    if x[0] == '\ufeff' : 
        x = x[1:]
    return x

In [5]:
all_data = []
all_ids = []
for file_path in all_data_paths : 
    if '.csv' in file_path : 
        data = pd.read_csv(data_dir + file_path )
        data = pd.DataFrame( columns = data.index[0] , data = np.vstack(data.index[1:]))
        data[' ID'] = data[' ID'].apply(corrcet_id)
        for id_ in data[' ID'].unique() : 
            if id_ not in all_ids : 
                all_ids.append(id_)
                temp = data[data[' ID'] == id_].copy()
                datetime_series = pd.to_datetime(temp['Date'])
                datetime_index = pd.DatetimeIndex(datetime_series.values)
                temp.set_index(datetime_index,inplace =True)
                temp.drop('Date',1,inplace =True)
                temp = temp[temp.index > '2000-01-01']
                temp['Value'] =  temp['Value'].apply(add_nans) 
                pct = temp['Value'].isnull().sum()/temp.shape[0]
                if pct < 0.1 : 
                    all_data.append(temp)
all_data = pd.concat(all_data)

/raid/apps/jupyter/1.0.0/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3063: DtypeWarning: Columns (1,3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)
/raid/apps/jupyter/1.0.0/lib/python3.7/site-packages/ipykernel_launcher.py:18: RuntimeWarning: invalid value encountered in long_scalars

In [6]:
all_data.head()

                 ID PARAM    Value
2000-01-02  06EB002     2  259.530
2000-01-03  06EB002     2  259.527
2000-01-04  06EB002     2  259.527
2000-01-05  06EB002     2  259.525
2000-01-06  06EB002     2  259.523

### Adding Latitude	and Longitude

In [7]:
stations_list = pd.read_csv('data/hydrometric_StationList (5).csv')

In [8]:
def corrcet_id(x) : 
    if x[0] == '\ufeff' : 
        x = x[1:]
    return x 
stations_list[' ID'] = stations_list[' ID'].apply(corrcet_id)

In [10]:
all_data.reset_index(inplace = True )

In [11]:
all_data = pd.merge(all_data , stations_list[[' ID' ,'Latitude', 'Longitude']] , on= ' ID' , how = 'left')

In [12]:
all_data

            index       ID PARAM    Value  Latitude  Longitude
0      2000-01-02  06EB002     2  259.530  56.23303 -100.57194
1      2000-01-03  06EB002     2  259.527  56.23303 -100.57194
2      2000-01-04  06EB002     2  259.527  56.23303 -100.57194
3      2000-01-05  06EB002     2  259.525  56.23303 -100.57194
4      2000-01-06  06EB002     2  259.523  56.23303 -100.57194
...           ...      ...   ...      ...       ...        ...
579246 2019-12-27  05TF004     2   257.61  56.13250  -99.48342
579247 2019-12-28  05TF004     2  257.611  56.13250  -99.48342
579248 2019-12-29  05TF004     2   257.61  56.13250  -99.48342
579249 2019-12-30  05TF004     2   257.61  56.13250  -99.48342
579250 2019-12-31  05TF004     2  257.611  56.13250  -99.48342

[579251 rows x 6 columns]

In [13]:
all_data.drop(all_data[all_data['Longitude'].isnull()].index , inplace = True)
all_data.head()

       index       ID PARAM    Value  Latitude  Longitude
0 2000-01-02  06EB002     2  259.530  56.23303 -100.57194
1 2000-01-03  06EB002     2  259.527  56.23303 -100.57194
2 2000-01-04  06EB002     2  259.527  56.23303 -100.57194
3 2000-01-05  06EB002     2  259.525  56.23303 -100.57194
4 2000-01-06  06EB002     2  259.523  56.23303 -100.57194

In [14]:
print('number of staions =' , all_data[' ID'].nunique() )

number of staions = 62

### Filling missed Values

In [15]:
print('Missing value ratio : ') 
all_data.isnull().sum() / all_data.shape[0]

Missing value ratio :

index        0.000000
 ID          0.000000
PARAM        0.000000
Value        0.016191
Latitude     0.000000
Longitude    0.000000
dtype: float64

In [16]:
all_data.fillna(method='ffill' , inplace = True)

In [19]:
all_data.columns = ['Date', 'ID', 'PARAM', 'Value', 'Latitude', 'Longitude']

In [20]:
all_data.to_csv('preprocessed_data.csv' , index = False )

# Add Climate Data

In [19]:
### TO do

In [21]:
all_data.head()

        Date       ID PARAM    Value  Latitude  Longitude
0 2000-01-02  06EB002     2  259.530  56.23303 -100.57194
1 2000-01-03  06EB002     2  259.527  56.23303 -100.57194
2 2000-01-04  06EB002     2  259.527  56.23303 -100.57194
3 2000-01-05  06EB002     2  259.525  56.23303 -100.57194
4 2000-01-06  06EB002     2  259.523  56.23303 -100.57194